Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pic32cz2051ca90208.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M7 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void FCW_Handler                   ( void );
void FCR_ECCERR_Handler            ( void );
void FCR_CRC_FAULT_Handler         ( void );
void PM_Handler                    ( void );
void SUPC_Handler                  ( void );
void OSCCTRL_FAIL_Handler          ( void );
void OSCCTRL_XOSCRDY_Handler       ( void );
void OSCCTRL_DFLLRDY_Handler       ( void );
void OSCCTRL_OTHER_Handler         ( void );
void OSCCTRL_LOCK_Handler          ( void );
void OSC32KCTRL_FAIL_Handler       ( void );
void OSC32KCTRL_RDY_Handler        ( void );
void MCLK_Handler                  ( void );
void FREQM_Handler                 ( void );
void WDT_Handler                   ( void );
void RTC_TAMPER_Handler            ( void );
void RTC_OVF_Handler               ( void );
void RTC_PERIOD_Handler            ( void );
void RTC_COMPARE_Handler           ( void );
void EIC_EXTINT_0_Handler          ( void );
void EIC_EXTINT_1_Handler          ( void );
void EIC_EXTINT_2_Handler          ( void );
void EIC_EXTINT_3_Handler          ( void );
void EIC_EXTINT_4_Handler          ( void );
void EIC_EXTINT_5_Handler          ( void );
void EIC_EXTINT_6_Handler          ( void );
void EIC_EXTINT_7_Handler          ( void );
void EIC_EXTINT_8_Handler          ( void );
void EIC_EXTINT_9_Handler          ( void );
void EIC_EXTINT_10_Handler         ( void );
void EIC_EXTINT_11_Handler         ( void );
void EIC_EXTINT_12_Handler         ( void );
void EIC_EXTINT_13_Handler         ( void );
void EIC_EXTINT_14_Handler         ( void );
void EIC_EXTINT_15_Handler         ( void );
void PAC_Handler                   ( void );
void DRMTCM_Handler                ( void );
void MCRAMC_Handler                ( void );
void TRAM_Handler                  ( void );
void DMA_PRI3_Handler              ( void );
void DMA_PRI2_Handler              ( void );
void DMA_PRI1_Handler              ( void );
void DMA_PRI0_Handler              ( void );
void EVSYS_0_Handler               ( void );
void EVSYS_1_Handler               ( void );
void EVSYS_2_Handler               ( void );
void EVSYS_3_Handler               ( void );
void EVSYS_4_Handler               ( void );
void EVSYS_5_Handler               ( void );
void EVSYS_6_Handler               ( void );
void EVSYS_7_Handler               ( void );
void EVSYS_8_Handler               ( void );
void EVSYS_9_Handler               ( void );
void EVSYS_10_Handler              ( void );
void EVSYS_11_Handler              ( void );
void SERCOM0_6_Handler             ( void );
void SERCOM0_5_Handler             ( void );
void SERCOM0_0_Handler             ( void );
void SERCOM0_1_Handler             ( void );
void SERCOM0_2_Handler             ( void );
void SERCOM0_3_Handler             ( void );
void SERCOM0_4_Handler             ( void );
void SERCOM1_6_Handler             ( void );
void SERCOM1_5_Handler             ( void );
void SERCOM1_0_Handler             ( void );
void SERCOM1_1_Handler             ( void );
void SERCOM1_2_Handler             ( void );
void SERCOM1_3_Handler             ( void );
void SERCOM1_4_Handler             ( void );
void SERCOM2_6_Handler             ( void );
void SERCOM2_5_Handler             ( void );
void SERCOM2_0_Handler             ( void );
void SERCOM2_1_Handler             ( void );
void SERCOM2_2_Handler             ( void );
void SERCOM2_3_Handler             ( void );
void SERCOM2_4_Handler             ( void );
void SERCOM3_6_Handler             ( void );
void SERCOM3_5_Handler             ( void );
void SERCOM3_0_Handler             ( void );
void SERCOM3_1_Handler             ( void );
void SERCOM3_2_Handler             ( void );
void SERCOM3_3_Handler             ( void );
void SERCOM3_4_Handler             ( void );
void SERCOM4_6_Handler             ( void );
void SERCOM4_5_Handler             ( void );
void SERCOM4_0_Handler             ( void );
void SERCOM4_1_Handler             ( void );
void SERCOM4_2_Handler             ( void );
void SERCOM4_3_Handler             ( void );
void SERCOM4_4_Handler             ( void );
void SERCOM5_6_Handler             ( void );
void SERCOM5_5_Handler             ( void );
void SERCOM5_0_Handler             ( void );
void SERCOM5_1_Handler             ( void );
void SERCOM5_2_Handler             ( void );
void SERCOM5_3_Handler             ( void );
void SERCOM5_4_Handler             ( void );
void SERCOM6_6_Handler             ( void );
void SERCOM6_5_Handler             ( void );
void SERCOM6_0_Handler             ( void );
void SERCOM6_1_Handler             ( void );
void SERCOM6_2_Handler             ( void );
void SERCOM6_3_Handler             ( void );
void SERCOM6_4_Handler             ( void );
void SERCOM7_6_Handler             ( void );
void SERCOM7_5_Handler             ( void );
void SERCOM7_0_Handler             ( void );
void SERCOM7_1_Handler             ( void );
void SERCOM7_2_Handler             ( void );
void SERCOM7_3_Handler             ( void );
void SERCOM7_4_Handler             ( void );
void SERCOM8_6_Handler             ( void );
void SERCOM8_5_Handler             ( void );
void SERCOM8_0_Handler             ( void );
void SERCOM8_1_Handler             ( void );
void SERCOM8_2_Handler             ( void );
void SERCOM8_3_Handler             ( void );
void SERCOM8_4_Handler             ( void );
void SERCOM9_6_Handler             ( void );
void SERCOM9_5_Handler             ( void );
void SERCOM9_0_Handler             ( void );
void SERCOM9_1_Handler             ( void );
void SERCOM9_2_Handler             ( void );
void SERCOM9_3_Handler             ( void );
void SERCOM9_4_Handler             ( void );
void TCC0_OTHER_Handler            ( void );
void TCC0_CNT_TRIG_Handler         ( void );
void TCC0_MC0_Handler              ( void );
void TCC0_MC1_Handler              ( void );
void TCC0_MC2_Handler              ( void );
void TCC0_MC3_Handler              ( void );
void TCC0_MC4_Handler              ( void );
void TCC0_MC5_Handler              ( void );
void TCC0_MC6_Handler              ( void );
void TCC0_MC7_Handler              ( void );
void TCC1_OTHER_Handler            ( void );
void TCC1_CNT_TRIG_Handler         ( void );
void TCC1_MC0_Handler              ( void );
void TCC1_MC1_Handler              ( void );
void TCC1_MC2_Handler              ( void );
void TCC1_MC3_Handler              ( void );
void TCC1_MC4_Handler              ( void );
void TCC1_MC5_Handler              ( void );
void TCC1_MC6_Handler              ( void );
void TCC1_MC7_Handler              ( void );
void TCC2_OTHER_Handler            ( void );
void TCC2_CNT_TRIG_Handler         ( void );
void TCC2_MC0_Handler              ( void );
void TCC2_MC1_Handler              ( void );
void TCC2_MC2_Handler              ( void );
void TCC2_MC3_Handler              ( void );
void TCC2_MC4_Handler              ( void );
void TCC2_MC5_Handler              ( void );
void TCC3_OTHER_Handler            ( void );
void TCC3_CNT_TRIG_Handler         ( void );
void TCC3_MC0_Handler              ( void );
void TCC3_MC1_Handler              ( void );
void TCC4_OTHER_Handler            ( void );
void TCC4_CNT_TRIG_Handler         ( void );
void TCC4_MC0_Handler              ( void );
void TCC4_MC1_Handler              ( void );
void TCC5_OTHER_Handler            ( void );
void TCC5_CNT_TRIG_Handler         ( void );
void TCC5_MC0_Handler              ( void );
void TCC5_MC1_Handler              ( void );
void TCC6_OTHER_Handler            ( void );
void TCC6_CNT_TRIG_Handler         ( void );
void TCC6_MC0_Handler              ( void );
void TCC6_MC1_Handler              ( void );
void TCC7_OTHER_Handler            ( void );
void TCC7_CNT_TRIG_Handler         ( void );
void TCC7_MC0_Handler              ( void );
void TCC7_MC1_Handler              ( void );
void TCC8_OTHER_Handler            ( void );
void TCC8_CNT_TRIG_Handler         ( void );
void TCC8_MC0_Handler              ( void );
void TCC8_MC1_Handler              ( void );
void TCC9_OTHER_Handler            ( void );
void TCC9_CNT_TRIG_Handler         ( void );
void TCC9_MC0_Handler              ( void );
void TCC9_MC1_Handler              ( void );
void TCC9_MC2_Handler              ( void );
void TCC9_MC3_Handler              ( void );
void TCC9_MC4_Handler              ( void );
void TCC9_MC5_Handler              ( void );
void ADC_GLOBAL_Handler            ( void );
void ADC_CORE1_Handler             ( void );
void ADC_CORE2_Handler             ( void );
void ADC_CORE3_Handler             ( void );
void ADC_CORE4_Handler             ( void );
void AC_Handler                    ( void );
void PTC_Handler                   ( void );
void SPI_IXS0_Handler              ( void );
void SPI_IXS1_Handler              ( void );
void CAN0_Handler                  ( void );
void CAN1_Handler                  ( void );
void CAN2_Handler                  ( void );
void CAN3_Handler                  ( void );
void CAN4_Handler                  ( void );
void CAN5_Handler                  ( void );
void ETH_PRI_Q_0_Handler           ( void );
void ETH_PRI_Q_1_Handler           ( void );
void ETH_PRI_Q_2_Handler           ( void );
void ETH_PRI_Q_3_Handler           ( void );
void ETH_PRI_Q_4_Handler           ( void );
void ETH_PRI_Q_5_Handler           ( void );
void SQI0_Handler                  ( void );
void SQI1_Handler                  ( void );
void TRNG_Handler                  ( void );
void SDMMC0_Handler                ( void );
void SDMMC1_Handler                ( void );
void USBHS0_Handler                ( void );
void USBHS1_Handler                ( void );
void HSM_TAMPER_Handler            ( void );
void HSM_TXINT_Handler             ( void );
void HSM_RXINT_Handler             ( void );
void MLB_GENERAL_Handler           ( void );
void MLB_BUSREQ_Handler            ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M7 Processor and Core Peripherals */
#define __CM7_REV                     0x0101 /* Cortex-M7 Revision                                                        */
#define __DCACHE_PRESENT                   1 /* DCACHE present or not                                                     */
#define __DEBUG_LVL                        1 /* Debug Level                                                               */
#define __DTCM_PRESENT                     1 /* DTCM present or not                                                       */
#define __FPU_DP                           1 /* FPU double-precision or not                                               */
#define __FPU_PRESENT                      1 /* FPU present or not                                                        */
#define __ICACHE_PRESENT                   1 /* ICACHE present or not                                                     */
#define __ITCM_PRESENT                     1 /* ITCM present or not                                                       */
#define __MPU_PRESENT                      1 /* MPU present or not                                                        */
#define __NVIC_PRIO_BITS                   3 /* Number of NVIC Priority bits                                              */
#define __TRACE_LVL                        1 /* Trace Level                                                               */
#define __VTOR_PRESENT                     1 /* VTOR present or not                                                       */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

