Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pic32cz2051ca90208.h
/* CMSIS includes */
#include "core_cm7.h"
#if defined USE_CMSIS_INIT
#include "system_pic32czca90.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CZ2051CA90208                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/can.h"
#include "component/dma.h"
#include "component/drmtcm.h"
#include "component/dsu.h"
#include "component/ebi.h"
#include "component/eic.h"
#include "component/eth.h"
#include "component/evsys.h"
#include "component/fcr.h"
#include "component/fcw.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/hsm.h"
#include "component/mclk.h"
#include "component/mcramc.h"
#include "component/mlb.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/prm.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sdmmc.h"
#include "component/sercom.h"
#include "component/spi_ixs.h"
#include "component/sqi.h"
#include "component/supc.h"
#include "component/tcc.h"
#include "component/tram.h"
#include "component/trng.h"
#include "component/usbhs.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CZ2051CA90208 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/can0.h"
#include "instance/can1.h"
#include "instance/can2.h"
#include "instance/can3.h"
#include "instance/can4.h"
#include "instance/can5.h"
#include "instance/dma.h"
#include "instance/drmtcm.h"
#include "instance/dsu.h"
#include "instance/ebi.h"
#include "instance/eic.h"
#include "instance/eth.h"
#include "instance/evsys.h"
#include "instance/fcr.h"
#include "instance/fcw.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/hsm.h"
#include "instance/mclk.h"
#include "instance/mcramc.h"
#include "instance/mlb.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/prm.h"
#include "instance/ptc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sdmmc0.h"
#include "instance/sdmmc1.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/sercom6.h"
#include "instance/sercom7.h"
#include "instance/sercom8.h"
#include "instance/sercom9.h"
#include "instance/spi_ixs0.h"
#include "instance/spi_ixs1.h"
#include "instance/sqi0.h"
#include "instance/sqi1.h"
#include "instance/supc.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/tcc3.h"
#include "instance/tcc4.h"
#include "instance/tcc5.h"
#include "instance/tcc6.h"
#include "instance/tcc7.h"
#include "instance/tcc8.h"
#include "instance/tcc9.h"
#include "instance/tram.h"
#include "instance/trng.h"
#include "instance/usbhs0.h"
#include "instance/usbhs1.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CZ2051CA90208                          */
/* ************************************************************************** */
#define ID_DSU           (  0) /* Instance index for DSU (DSU) */
#define ID_FCW           (  1) /* Instance index for FCW (FCW) */
#define ID_FCR           (  2) /* Instance index for FCR (FCR) */
#define ID_PM            (  3) /* Instance index for PM (PM) */
#define ID_SUPC          (  4) /* Instance index for SUPC (SUPC) */
#define ID_RSTC          (  5) /* Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  6) /* Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  7) /* Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_GCLK          (  8) /* Instance index for GCLK (GCLK) */
#define ID_MCLK          (  9) /* Instance index for MCLK (MCLK) */
#define ID_FREQM         ( 10) /* Instance index for FREQM (FREQM) */
#define ID_WDT           ( 11) /* Instance index for WDT (WDT) */
#define ID_RTC           ( 12) /* Instance index for RTC (RTC) */
#define ID_EIC           ( 13) /* Instance index for EIC (EIC) */
#define ID_PAC           ( 14) /* Instance index for PAC (PAC) */
#define ID_DRMTCM        ( 15) /* Instance index for DRMTCM (DRMTCM) */
#define ID_MCRAMC        ( 16) /* Instance index for MCRAMC (MCRAMC) */
#define ID_TRAM          ( 17) /* Instance index for TRAM (TRAM) */
#define ID_PORT          ( 18) /* Instance index for PORT (PORT) */
#define ID_DMA           ( 19) /* Instance index for DMA (DMA) */
#define ID_PRM           ( 21) /* Instance index for PRM (PRM) */
#define ID_EVSYS         ( 22) /* Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 23) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 24) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 25) /* Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 26) /* Instance index for SERCOM3 (SERCOM3) */
#define ID_SERCOM4       ( 27) /* Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 28) /* Instance index for SERCOM5 (SERCOM5) */
#define ID_SERCOM6       ( 29) /* Instance index for SERCOM6 (SERCOM6) */
#define ID_SERCOM7       ( 30) /* Instance index for SERCOM7 (SERCOM7) */
#define ID_SERCOM8       ( 31) /* Instance index for SERCOM8 (SERCOM8) */
#define ID_SERCOM9       ( 32) /* Instance index for SERCOM9 (SERCOM9) */
#define ID_TCC0          ( 33) /* Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 34) /* Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 35) /* Instance index for TCC2 (TCC2) */
#define ID_TCC3          ( 36) /* Instance index for TCC3 (TCC3) */
#define ID_TCC4          ( 37) /* Instance index for TCC4 (TCC4) */
#define ID_TCC5          ( 38) /* Instance index for TCC5 (TCC5) */
#define ID_TCC6          ( 39) /* Instance index for TCC6 (TCC6) */
#define ID_TCC7          ( 40) /* Instance index for TCC7 (TCC7) */
#define ID_TCC8          ( 41) /* Instance index for TCC8 (TCC8) */
#define ID_TCC9          ( 42) /* Instance index for TCC9 (TCC9) */
#define ID_ADC           ( 43) /* Instance index for ADC (ADC) */
#define ID_AC            ( 44) /* Instance index for AC (AC) */
#define ID_PTC           ( 45) /* Instance index for PTC (PTC) */
#define ID_SPI_IXS0      ( 46) /* Instance index for SPI_IXS0 (SPI_IXS0) */
#define ID_SPI_IXS1      ( 47) /* Instance index for SPI_IXS1 (SPI_IXS1) */
#define ID_CAN0          ( 48) /* Instance index for CAN0 (CAN0) */
#define ID_CAN1          ( 49) /* Instance index for CAN1 (CAN1) */
#define ID_CAN2          ( 50) /* Instance index for CAN2 (CAN2) */
#define ID_CAN3          ( 51) /* Instance index for CAN3 (CAN3) */
#define ID_CAN4          ( 52) /* Instance index for CAN4 (CAN4) */
#define ID_CAN5          ( 53) /* Instance index for CAN5 (CAN5) */
#define ID_ETH           ( 56) /* Instance index for ETH (ETH) */
#define ID_SQI0          ( 57) /* Instance index for SQI0 (SQI0) */
#define ID_SQI1          ( 58) /* Instance index for SQI1 (SQI1) */
#define ID_TRNG          ( 59) /* Instance index for TRNG (TRNG) */
#define ID_SDMMC0        ( 60) /* Instance index for SDMMC0 (SDMMC0) */
#define ID_SDMMC1        ( 61) /* Instance index for SDMMC1 (SDMMC1) */
#define ID_MLB           ( 66) /* Instance index for MLB (MLB) */

#define ID_PERIPH_MAX    ( 66) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CZ2051CA90208            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x46822000)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x46820000)                /* ADC Registers Address        */
#define CAN0_REGS                        ((can_registers_t*)0x45060000)                /* CAN0 Registers Address       */
#define CAN1_REGS                        ((can_registers_t*)0x46060000)                /* CAN1 Registers Address       */
#define CAN2_REGS                        ((can_registers_t*)0x46062000)                /* CAN2 Registers Address       */
#define CAN3_REGS                        ((can_registers_t*)0x45860000)                /* CAN3 Registers Address       */
#define CAN4_REGS                        ((can_registers_t*)0x45062000)                /* CAN4 Registers Address       */
#define CAN5_REGS                        ((can_registers_t*)0x46860000)                /* CAN5 Registers Address       */
#define DMA_REGS                         ((dma_registers_t*)0x44850000)                /* DMA Registers Address        */
#define DRMTCM_REGS                      ((drmtcm_registers_t*)0x44820000)             /* DRMTCM Registers Address     */
#define DSU_REGS                         ((dsu_registers_t*)0x44000000)                /* DSU Registers Address        */
#define EBI_REGS                         ((ebi_registers_t*)0x458b0000)                /* EBI Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x44800000)                /* EIC Registers Address        */
#define ETH_REGS                         ((eth_registers_t*)0x45070000)                /* ETH Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x44860000)              /* EVSYS Registers Address      */
#define FCR_REGS                         ((fcr_registers_t*)0x44004000)                /* FCR Registers Address        */
#define FCW_REGS                         ((fcw_registers_t*)0x44002000)                /* FCW Registers Address        */
#define FREQM_REGS                       ((freqm_registers_t*)0x44060000)              /* FREQM Registers Address      */
#define FUSES_BOOTCFG1_REGS              ((fuses_bootcfg1_registers_t*)0x0a002000)     /* FUSES Registers Address      */
#define FUSES_BOOTCFG2_REGS              ((fuses_bootcfg1_registers_t*)0x0a00a000)     /* FUSES Registers Address      */
#define FUSES_CALOTP_REGS                ((fuses_calotp_registers_t*)0x0a007000)       /* FUSES Registers Address      */
#define FUSES_DALCFG_REGS                ((fuses_dalcfg_registers_t*)0x0a004000)       /* FUSES Registers Address      */
#define FUSES_USERCFG1_REGS              ((fuses_usercfg1_registers_t*)0x0a000000)     /* FUSES Registers Address      */
#define FUSES_USERCFG2_REGS              ((fuses_usercfg1_registers_t*)0x0a008000)     /* FUSES Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x44050000)               /* GCLK Registers Address       */
#define HSM_REGS                         ((hsm_registers_t*)0x4f018000)                /* HSM Registers Address        */
#define MCLK_REGS                        ((mclk_registers_t*)0x44052000)               /* MCLK Registers Address       */
#define MCRAMC_REGS                      ((mcramc_registers_t*)0x44822000)             /* MCRAMC Registers Address     */
#define MLB_REGS                         ((mlb_registers_t*)0x458c0000)                /* MLB Registers Address        */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x44042000)         /* OSC32KCTRL Registers Address */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x44040000)            /* OSCCTRL Registers Address    */
#define PAC_REGS                         ((pac_registers_t*)0x44810000)                /* PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x44010000)                 /* PM Registers Address         */
#define PORT_AHB_REGS                    ((port_registers_t*)0x40000000)               /* PORT Registers Address       */
#define PORT_REGS                        ((port_registers_t*)0x44840000)               /* PORT Registers Address       */
#define PRM_REGS                         ((prm_registers_t*)0x44080000)                /* PRM Registers Address        */
#define PTC_REGS                         ((ptc_registers_t*)0x46828000)                /* PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x44030000)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x44072000)                /* RTC Registers Address        */
#define SDMMC0_REGS                      ((sdmmc_registers_t*)0x458a0000)              /* SDMMC0 Registers Address     */
#define SDMMC1_REGS                      ((sdmmc_registers_t*)0x460a0000)              /* SDMMC1 Registers Address     */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x46000000)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x46002000)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x45800000)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x45802000)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x46004000)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x45804000)             /* SERCOM5 Registers Address    */
#define SERCOM6_REGS                     ((sercom_registers_t*)0x45806000)             /* SERCOM6 Registers Address    */
#define SERCOM7_REGS                     ((sercom_registers_t*)0x45000000)             /* SERCOM7 Registers Address    */
#define SERCOM8_REGS                     ((sercom_registers_t*)0x45002000)             /* SERCOM8 Registers Address    */
#define SERCOM9_REGS                     ((sercom_registers_t*)0x45004000)             /* SERCOM9 Registers Address    */
#define SPI_IXS0_REGS                    ((spi_ixs_registers_t*)0x46030000)            /* SPI_IXS0 Registers Address   */
#define SPI_IXS1_REGS                    ((spi_ixs_registers_t*)0x45030000)            /* SPI_IXS1 Registers Address   */
#define SQI0_REGS                        ((sqi_registers_t*)0x4f008000)                /* SQI0 Registers Address       */
#define SQI1_REGS                        ((sqi_registers_t*)0x4f009000)                /* SQI1 Registers Address       */
#define SUPC_REGS                        ((supc_registers_t*)0x44020000)               /* SUPC Registers Address       */
#define TCC0_REGS                        ((tcc_registers_t*)0x45010000)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x45012000)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x45014000)                /* TCC2 Registers Address       */
#define TCC3_REGS                        ((tcc_registers_t*)0x45810000)                /* TCC3 Registers Address       */
#define TCC4_REGS                        ((tcc_registers_t*)0x45812000)                /* TCC4 Registers Address       */
#define TCC5_REGS                        ((tcc_registers_t*)0x46010000)                /* TCC5 Registers Address       */
#define TCC6_REGS                        ((tcc_registers_t*)0x46012000)                /* TCC6 Registers Address       */
#define TCC7_REGS                        ((tcc_registers_t*)0x46810000)                /* TCC7 Registers Address       */
#define TCC8_REGS                        ((tcc_registers_t*)0x46812000)                /* TCC8 Registers Address       */
#define TCC9_REGS                        ((tcc_registers_t*)0x46814000)                /* TCC9 Registers Address       */
#define TRAM_REGS                        ((tram_registers_t*)0x44824000)               /* TRAM Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x44870000)               /* TRNG Registers Address       */
#define USBHS0_REGS                      ((usbhs_registers_t*)0x4f010000)              /* USBHS0 Registers Address     */
#define USBHS1_REGS                      ((usbhs_registers_t*)0x4f012000)              /* USBHS1 Registers Address     */
#define WDT_REGS                         ((wdt_registers_t*)0x44070000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

